In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)

In [3]:
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [4]:
df1=pd.DataFrame(
{
  "Name":["Kalua","Murgichor","kaluthi"],
    "Age":[22,23,24],
    "Sex":["male","male","female"]
}
)

In [5]:
print(df,df1)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female         Name  Age     Sex
0      Kalua   22    male
1  Murgichor   23    male
2    kaluthi   24  female

In [6]:
df1

        Name  Age     Sex
0      Kalua   22    male
1  Murgichor   23    male
2    kaluthi   24  female

In [7]:
df2=pd.DataFrame(
    {"Company":["RCM","Quantum","BT"],
     "Turnover":["10 cr","12 cr","2 cr"],
     "Sector":["Service","Service","Service"],
     "Work days":["5 Days","5 Days","4 Days"],
     "Location":["Delhi","Noida","Gurgaon"]
    }
)

In [8]:
df2

   Company Turnover   Sector Work days Location
0      RCM    10 cr  Service    5 Days    Delhi
1  Quantum    12 cr  Service    5 Days    Noida
2       BT     2 cr  Service    4 Days  Gurgaon

In [9]:
df["Age"]

0    22
1    35
2    58
Name: Age, dtype: int64

In [10]:
df["Sex"]

0      male
1      male
2    female
Name: Sex, dtype: object

In [11]:
ages = pd.Series([22, 35, 78], name="Age")

In [12]:
ages

0    22
1    35
2    78
Name: Age, dtype: int64

In [13]:
names=pd.Series(["Rahul","Risabh","Abhishek"], name="Name Header")

In [14]:
names

0       Rahul
1      Risabh
2    Abhishek
Name: Name Header, dtype: object

In [15]:
df["Age"].max()

58

In [16]:
ages.max()

78

In [17]:
df.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

In [18]:
df1.describe()

        Age
count   3.0
mean   23.0
std     1.0
min    22.0
25%    22.5
50%    23.0
75%    23.5
max    24.0

In [19]:
df2.describe()

       Company Turnover   Sector Work days Location
count        3        3        3         3        3
unique       3        3        1         2        3
top        RCM    10 cr  Service    5 Days    Delhi
freq         1        1        3         2        1

In [20]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)

In [21]:
df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)

In [22]:
df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)

In [23]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [24]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [25]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [26]:
frames = [df1, df2, df3]

In [27]:
result = pd.concat(frames)

In [28]:
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [29]:
import pandas._testing as tm

def unpivot(frame):
    N, K = frame.shape
    data = {
        "value": frame.to_numpy().ravel("F"),
        "variable": np.asarray(frame.columns).repeat(N),
        "date": np.tile(np.asarray(frame.index), K),
    }
    return pd.DataFrame(data, columns=["date", "variable", "value"])

In [30]:
df = unpivot(tm.makeTimeDataFrame(3))

In [31]:
df

         date variable     value
0  2000-01-03        A -0.745139
1  2000-01-04        A -1.101455
2  2000-01-05        A  0.833034
3  2000-01-03        B  1.087701
4  2000-01-04        B  0.529101
5  2000-01-05        B -0.903088
6  2000-01-03        C  0.238876
7  2000-01-04        C  0.035395
8  2000-01-05        C  0.802901
9  2000-01-03        D  0.608678
10 2000-01-04        D  0.034354
11 2000-01-05        D  0.482009

In [32]:
pivoted = df.pivot(index="date", columns="variable", values="value")

In [33]:
pivoted

variable           A         B         C         D
date
2000-01-03 -0.745139  1.087701  0.238876  0.608678
2000-01-04 -1.101455  0.529101  0.035395  0.034354
2000-01-05  0.833034 -0.903088  0.802901  0.482009

In [34]:
df["value2"] = df["value"] * 2

In [35]:
pivoted = df.pivot(index="date", columns="variable")

In [36]:
pivoted

               value                                  value2            \
variable           A         B         C         D         A         B
date
2000-01-03 -0.745139  1.087701  0.238876  0.608678 -1.490277  2.175401
2000-01-04 -1.101455  0.529101  0.035395  0.034354 -2.202910  1.058201
2000-01-05  0.833034 -0.903088  0.802901  0.482009  1.666067 -1.806177


variable           C         D
date
2000-01-03  0.477752  1.217357
2000-01-04  0.070790  0.068708
2000-01-05  1.605802  0.964018

In [37]:
tuples = list(
    zip(
        *[
            ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
            ["one", "two", "one", "two", "one", "two", "one", "two"],
        ]
    )
)

In [38]:
index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])

In [39]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])

In [40]:
df

                     A         B
first second
bar   one    -0.599985 -0.041372
      two    -1.545224  1.218751
baz   one    -0.234475  0.657577
      two    -1.004143  0.716820
foo   one     1.175383 -1.217352
      two     0.324417  0.612307
qux   one    -1.492434  1.937223
      two     0.453900 -0.994841

In [41]:
df2 = df[:4]

In [42]:
df2

                     A         B
first second
bar   one    -0.599985 -0.041372
      two    -1.545224  1.218751
baz   one    -0.234475  0.657577
      two    -1.004143  0.716820

In [43]:
stacked = df2.stack()

In [44]:
stacked

first  second
bar    one     A   -0.599985
               B   -0.041372
       two     A   -1.545224
               B    1.218751
baz    one     A   -0.234475
               B    0.657577
       two     A   -1.004143
               B    0.716820
dtype: float64

In [45]:
stacked

first  second
bar    one     A   -0.599985
               B   -0.041372
       two     A   -1.545224
               B    1.218751
baz    one     A   -0.234475
               B    0.657577
       two     A   -1.004143
               B    0.716820
dtype: float64

In [46]:
stacked.unstack()

                     A         B
first second
bar   one    -0.599985 -0.041372
      two    -1.545224  1.218751
baz   one    -0.234475  0.657577
      two    -1.004143  0.716820

In [47]:
stacked.unstack("second")

second        one       two
first
bar   A -0.599985 -1.545224
      B -0.041372  1.218751
baz   A -0.234475 -1.004143
      B  0.657577  0.716820

In [48]:
index = pd.MultiIndex.from_product([[2, 1], ["a", "b"]])

In [49]:
index = pd.MultiIndex.from_product([[2, 1], ["a", "b"]])

In [50]:
pd.options.display.max_rows

60

In [51]:
index = pd.MultiIndex.from_tuples([("person", "A"), ("person", "B")])

In [52]:
cheese = pd.DataFrame(
    {
        "first": ["John", "Mary"],
        "last": ["Doe", "Bo"],
        "height": [5.5, 6.0],
        "weight": [130, 150],
    },
    index=index,
)

In [53]:
cheese

         first last  height  weight
person A  John  Doe     5.5     130
       B  Mary   Bo     6.0     150

In [54]:
cheese.melt(id_vars=["first", "last"])

  first last variable  value
0  John  Doe   height    5.5
1  Mary   Bo   height    6.0
2  John  Doe   weight  130.0
3  Mary   Bo   weight  150.0

In [55]:
cheese.melt(id_vars=["first", "last"], ignore_index=False)

         first last variable  value
person A  John  Doe   height    5.5
       B  Mary   Bo   height    6.0
       A  John  Doe   weight  130.0
       B  Mary   Bo   weight  150.0

In [56]:
pd.options.display.max_rows = 999

In [57]:
cheese.melt

<bound method DataFrame.melt of          first last  height  weight
person A  John  Doe     5.5     130
       B  Mary   Bo     6.0     150>

In [58]:
dft = pd.DataFrame(
    {
        "A1970": {0: "a", 1: "b", 2: "c"},
        "A1980": {0: "d", 1: "e", 2: "f"},
        "B1970": {0: 2.5, 1: 1.2, 2: 0.7},
        "B1980": {0: 3.2, 1: 1.3, 2: 0.1},
        "X": dict(zip(range(3), np.random.randn(3))),
    }
)

In [59]:
dft

  A1970 A1980  B1970  B1980         X
0     a     d    2.5    3.2 -0.609308
1     b     e    1.2    1.3 -0.425236
2     c     f    0.7    0.1 -2.734817

In [60]:
idx = pd.Index([" jack", "jill ", " jesse ", "frank"])

In [61]:
idx

Index([' jack', 'jill ', ' jesse ', 'frank'], dtype='object')

In [62]:
u = pd.Series(["b", "d", "a", "c"], index=[1, 3, 0, 2], dtype="string")